In [15]:
import pandas as pd
import seaborn as sns

In [16]:
df = sns.load_dataset('tips')
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [17]:
df.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [18]:
df['tip'] = df['tip'].astype(int)

In [19]:
df.dtypes

total_bill     float64
tip              int64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [20]:
gf = pd.read_excel('copa_group_a.xlsx')
gf

   Unnamed: 0       Team  Matches played  Won  Draw  Lost  Points
0           0  Argentina               3    3     0     0       9
1           1     Canada               3    1     1     1       4
2           2      Chile               3    0     2     1       2
3           3       Peru               3    0     1     2       1

In [21]:
gf.rename(columns={'Team': 'Squad', 'Matches played': 'mp'}, inplace=True)
gf

   Unnamed: 0      Squad  mp  Won  Draw  Lost  Points
0           0  Argentina   3    3     0     0       9
1           1     Canada   3    1     1     1       4
2           2      Chile   3    0     2     1       2
3           3       Peru   3    0     1     2       1

adding prefix

In [22]:
gf.add_prefix('A_')

   A_Unnamed: 0    A_Squad  A_mp  A_Won  A_Draw  A_Lost  A_Points
0             0  Argentina     3      3       0       0         9
1             1     Canada     3      1       1       1         4
2             2      Chile     3      0       2       1         2
3             3       Peru     3      0       1       2         1

adding suffix

In [23]:
gf.add_suffix('_1')

   Unnamed: 0_1    Squad_1  mp_1  Won_1  Draw_1  Lost_1  Points_1
0             0  Argentina     3      3       0       0         9
1             1     Canada     3      1       1       1         4
2             2      Chile     3      0       2       1         2
3             3       Peru     3      0       1       2         1

importing datasets

In [24]:
diamonds = sns.load_dataset('diamonds')
diamonds

       carat        cut color clarity  depth  table   price     x     y     z
0       0.23      Ideal     E     SI2   61.5   55.0   326.0  3.95  3.98  2.43
1       0.21    Premium     E     SI1   59.8   61.0   326.0  3.89  3.84  2.31
2       0.23       Good     E     VS1   56.9   65.0   327.0  4.05  4.07  2.31
3       0.29    Premium     I     VS2   62.4   58.0   334.0  4.20  4.23  2.63
4       0.31       Good     J     SI2   63.3   58.0   335.0  4.34  4.35  2.75
...      ...        ...   ...     ...    ...    ...     ...   ...   ...   ...
13244   1.14      Ideal     E     SI2   62.4   57.0  5473.0  6.64  6.70  4.16
13245   1.20  Very Good     G     SI2   60.2   63.0  5474.0  6.81  6.84  4.11
13246   1.20    Premium     I     VS2   62.1   59.0  5474.0  6.77  6.72  4.19
13247   1.01       Fair     G     VS2   66.6   55.0  5475.0  6.27  6.22  4.16
13248   0.90  Very Good   NaN     NaN    NaN    NaN     NaN   NaN   NaN   NaN

[13249 rows x 10 columns]

In [11]:
diamonds.to_excel('diamonds.xlsx')

reversing the rows

In [12]:
diamonds.loc[::-1]

       carat        cut color clarity  depth  table   price     x     y     z
13248   0.90  Very Good   NaN     NaN    NaN    NaN     NaN   NaN   NaN   NaN
13247   1.01       Fair     G     VS2   66.6   55.0  5475.0  6.27  6.22  4.16
13246   1.20    Premium     I     VS2   62.1   59.0  5474.0  6.77  6.72  4.19
13245   1.20  Very Good     G     SI2   60.2   63.0  5474.0  6.81  6.84  4.11
13244   1.14      Ideal     E     SI2   62.4   57.0  5473.0  6.64  6.70  4.16
...      ...        ...   ...     ...    ...    ...     ...   ...   ...   ...
4       0.31       Good     J     SI2   63.3   58.0   335.0  4.34  4.35  2.75
3       0.29    Premium     I     VS2   62.4   58.0   334.0  4.20  4.23  2.63
2       0.23       Good     E     VS1   56.9   65.0   327.0  4.05  4.07  2.31
1       0.21    Premium     E     SI1   59.8   61.0   326.0  3.89  3.84  2.31
0       0.23      Ideal     E     SI2   61.5   55.0   326.0  3.95  3.98  2.43

[13249 rows x 10 columns]

In [13]:
importing file from computer

SyntaxError: invalid syntax (3127422694.py, line 1)

In [ ]:
hi = pd.read_excel('tips_2.xlsx')
hi

     Unnamed: 0  total_bill   tip     sex smoker   day    time  size
0             0       16.99  1.01  Female     No   Sun  Dinner     2
1             1       10.34  1.66    Male     No   Sun  Dinner     3
2             2       21.01  3.50    Male     No   Sun  Dinner     3
3             3       23.68  3.31    Male     No   Sun  Dinner     2
4             4       24.59  3.61  Female     No   Sun  Dinner     4
..          ...         ...   ...     ...    ...   ...     ...   ...
239         239       29.03  5.92    Male     No   Sat  Dinner     3
240         240       27.18  2.00  Female    Yes   Sat  Dinner     2
241         241       22.67  2.00    Male    Yes   Sat  Dinner     2
242         242       17.82  1.75    Male     No   Sat  Dinner     2
243         243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 8 columns]

In [ ]:
copa = pd.read_excel("copa_group_a.xlsx")
copa

   Unnamed: 0       Team  Matches played  Won  Draw  Lost  Points
0           0  Argentina               3    3     0     0       9
1           1     Canada               3    1     1     1       4
2           2      Chile               3    0     2     1       2
3           3       Peru               3    0     1     2       1

In [ ]:
copa.loc[::-1]

   Unnamed: 0       Team  Matches played  Won  Draw  Lost  Points
3           3       Peru               3    0     1     2       1
2           2      Chile               3    0     2     1       2
1           1     Canada               3    1     1     1       4
0           0  Argentina               3    3     0     0       9

reverse rows

In [ ]:
copa.loc[:, ::-1]

   Points  Lost  Draw  Won  Matches played       Team  Unnamed: 0
0       9     0     0    3               3  Argentina           0
1       4     1     1    1               3     Canada           1
2       2     1     2    0               3      Chile           2
3       1     2     1    0               3       Peru           3

In [ ]:
copa.loc[:, ::1]

   Unnamed: 0       Team  Matches played  Won  Draw  Lost  Points
0           0  Argentina               3    3     0     0       9
1           1     Canada               3    1     1     1       4
2           2      Chile               3    0     2     1       2
3           3       Peru               3    0     1     2       1

In [ ]:
copa.astype({'Won': 'int'}).dtypes

Unnamed: 0         int64
Team              object
Matches played     int64
Won                int64
Draw               int64
Lost               int64
Points             int64
dtype: object

includ and exlude colums trought filters

In [ ]:
copa.select_dtypes(include=['object'])

        Team
0  Argentina
1     Canada
2      Chile
3       Peru

In [ ]:
copa.select_dtypes(exclude=['object'])

   Unnamed: 0  Matches played  Won  Draw  Lost  Points
0           0               3    3     0     0       9
1           1               3    1     1     1       4
2           2               3    0     2     1       2
3           3               3    0     1     2       1

In [ ]:
len(copa)

4

In [14]:
copa

NameError: name 'copa' is not defined